FramaC/exercises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Frama-C Exercises</title>
<!-- 2017-07-03 Mon 15:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Frama-C Exercises</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What is Frama-C</a></li>
<li><a href="#sec-2">2. Small Examples</a>
<ul>
<li><a href="#sec-2-1">2.1. Sorting</a></li>
<li><a href="#sec-2-2">2.2. C Standard Library</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Sizeable Examples</a>
<ul>
<li><a href="#sec-3-1">3.1. Linux Kernel Components</a></li>
<li><a href="#sec-3-2">3.2. Frama-C and Heartbleed</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Exercises</a>
<ul>
<li><a href="#sec-4-1">4.1. QuickSort</a></li>
</ul>
</li>
<li><a href="#sec-5">5. References</a></li>
<li><a href="#sec-6">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is Frama-C</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="./index.html">./index.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Small Examples</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://frama-c.com/acsl_tutorial_index.html">https://frama-c.com/acsl_tutorial_index.html</a> Introduces ACSL.
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Sorting</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li><a href="https://frama-c.com/jessie_tutorial_index.html">https://frama-c.com/jessie_tutorial_index.html</a> Includes Sort
examples
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> C Standard Library</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Jochen Burghardt Jens Gerlach Timon Lapawczyk, Former Authors:
Andreas Carben Liangliang Gu Kerstin Hartig Hans Pohl Juan Soto Kim
Völlinger, <a href="https://www.cs.umd.edu/class/spring2016/cmsc838G/frama-c/ACSL-by-Example-12.1.0.pdf">ACSL By Example: Towards a Verified C Standard Library</a>",
155pp, 2016.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Sizeable Examples</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Linux Kernel Components</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Alexey Khoroshilov Mikhail Mandrykin, <a href="https://frama-c.com/download/framaCDay/FCSD17/talk/06_Khoroshilov_Mandrykin.pdf">Specifying and Proving
Correctness of Linux Kernel Components with ACSL</a>, 35+ slides, 2017,
Institute for System Programming of the Russian Academy of
Sciences; {pm: Has several Frama-C examples}
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Frama-C and Heartbleed</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li><a href="http://www.pl-enthusiast.net/2014/07/01/how-did-heartbleed-remain-undiscovered-and-what-should-we-do-about-it/">http://www.pl-enthusiast.net/2014/07/01/how-did-heartbleed-remain-undiscovered-and-what-should-we-do-about-it/</a>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Exercises</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> QuickSort</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>QuickSort in Frama-C/ACSL To Be Done by 
</li>
<li>QuickSort and the Partitioning Idea: Algorithm explanation
</li>
<li>Assertions
</li>
<li>QuickSort written in C++
</li>
<li><a href="../Examples/QuickSort/index.html">../Examples/QuickSort/index.html</a> all the above
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-06-08
</div>
</body>
</html>
